export const CLIENT_SUBSCRIPTIONS_LIST = "CLIENT_SUBSCRIPTIONS_LIST";

var recipes = [
[
'Салат Цезарь с курицей и сухариками', 
`Куриное филе  — 150 Грамм
Помидор  — 1 Штука
Яйцо  — 2 Штуки
Хлеб белый  — 2 Ломтика
Листья салата  — 4-5 Штук
Оливковое масло  — 2 Ст. ложки
Лимонный сок  — 1 Ст. ложка
Горчица  — По вкусу
Кунжутные семечки  — 2 Щепотки`,
`Подготовьте все необходимые ингредиенты. Яйца отварите вкрутую.
Куриное филе порежьте на небольшие по размеру пластины толщиной 5-6 мм. и обжарьте в небольшом количестве растительного масла до золотистой корочки. Идеально, если вы будете жарить их на гриле.
Хлеб порежьте на небольшие кубики и подсушите в духовке или микроволновке.
Помидор очистите и порежьте нетолстыми дольками.
Соберите салат. На дно тарелки положите промытые листья салата, сверху положите помидоры, сухарики, порезанные дольками яйца и кусочки курицы`
],

[
'Жареный картофель с оливками и лимоном', 
`Оливки 1/4 стакана
Красный картофель 450 г
Оливковое масло 2 столовые ложки
Лимонная цедра 6 кусков
Молотый кумин 1/2 чайной ложки
Вода 1 стакан
Рубленая петрушка 1/2 стакана
Лимон 1 штука
Соль по вкусу
Молотый черный перец по вкусу`,
`Разомните оливки и лимон ножом, извлеките косточки и мелко нарежьте.
Нарежьте картофель на небольшие кусочки или разрежьте вдоль пополам, если картофель не очень большой. Переложите в миску и смешайте с нарезанными оливками, маслом, цедрой одного лимона, кумином, 0,5 чайной ложки соли и 0,25 чайной ложки черного перца. Сбрызните лимонным соком. Хорошо перемешайте и выложите в глубокую сковороду. Добавьте воду и доведите до кипения.
Накройте крышкой и варите на среднем огне 10-12 минут, пока картофель не станет мягким. Снимите крышку и готовьте еще 1-2 минуты, пока вода не выпарится. Подавайте, посыпав петрушкой.`
],

[
'Вареники', 
`Картофель  — 500 Грамм
Мука  — 270 Грамм
Яйца  — 2 Штуки
Молоко  — 100 Миллилитров
Лук  — 2 Штуки
Растительное масло  — 50 Миллилитров
Сливочное масло  — 50 Грамм
Сахар  — 2 Ст. ложки
Соль  — По вкусу`,
`Картофель очистите и отварите до готовности.
В миске смешайте муку, молоко, яйца и 2 ст.л. растительного масла. замешайте однородное тесто и оставьте его накрытым на 30 минут.
В небольшой сковороде обжарьте мелко нарезанный лук до мягкого состояния.
Картофель разомните, добавьте обжаренный лук. Посолите и поперчите по вкусу.
Тесто раскатайте в тонкий пласт, выдавите круглым стаканом кружочки. В полученные кружочки выложите по 1 ч.л. начинки, сложите пополам. Защипните края.
Полученные вареники отварите в кипящей воде (по 3 минуты) после всплытия.`
],

[
'вкусный борщ', 
`Мясо для бульона  — 400-450 Грамм
Картофель  — 4 Штуки
Луковица  — 1 Штука
Морковь  — 1 Штука
Свекла  — 3 Штуки
Капуста  — 1/2 Штуки
Чеснок  — 2-3 Зубчиков
Томатная паста  — 2 Ст. ложки
Уксус  — 1 Ст. ложка
Соль, перец, растительное масло  — По вкусу
Вода  — 3-4 Литров`,
`Для начала необходимо сварить бульон. Мясо вымойте, выложите в кастрюлю и залейте водой. После закипания уберите огонь до минимума и варите до мягкости мяса (время зависит от того, какое именно мясо вы выбрали). Аккуратно достаньте его из бульона после готовности.
Бульон при желании процедите. Подсолите по вкусу и выложите нарезанный кубиками картофель. Варите около 10-12 минут.
Лук с морковью очистите, измельчите и обжарьте на сковороде с небольшим количеством растительного масла.
В кастрюлю с бульоном выложите обжаренные овощи и мелко нашинкованную капусту.
На сковороду тем временем налейте еще немного масла и выложите тертую свеклу. Обжарьте пару минут и добавьте уксус. Тушите еще минут 5, а после выложите томатную пасту. Томите на медленном огне еще 5-7 минут.
В бульон выложите мясо, предварительно нарезав его порционными кусочками, и свеклу.
По вкусу добавьте соль, перец, сахар и чеснок. Варите еще минут 7-10 до готовности картофеля. После снимите с огня, накройте крышкой и оставьте на полчасика настояться. Перед подачей можно добавить зелень и сметану. Приятного аппетита!`
],

[
'Гороховый суп  c сосиской', 
`Горох  — 1 Стакан
Ребра свининые  — 300 Грамм
Луковица  — 1 Штука
Морковь  — 1-2 Штук
Картофель  — 4-6 Штук
Чеснок  — 3-4 Зубчиков
Растительное масло  — По вкусу
Соль, специи, зелень  — По вкусу`,
`Первым делом промойте горох несколько раз под проточной водой. Затем переложите его в кастрюлю. Туда же отправьте вымытое мясо. Залейте водой и поставьте на огонь. После закипания подсолите немного и варите бульон на медленном огне, убирая шумовкой пену.
Часа через полтора очистите и нарежьте средними кубиками картофель и половину моркови. Выложите в кастрюлю и варите минут 15.
Очистите и измельчите лук, натрите на терке вторую половину моркови и чеснок. Обжарьте на сковороде с растительным маслом лук до прозрачности, добавьте морковь. Минут через 5 выложите на сковороду чеснок и немного измельченной зелени. Обжаренные овощи добавьте в кастрюлю.
Добавьте соль, перец, лавровый лист и другие специи для вкуса и аромата.
Варите на среднем огне супчик до мягкости овощей. Готовое мясо достаньте из кастрюли, измельчите мякоть. Отправьте обратно.`
],

[
'Венгерская закуска "дядя Ваня"', 
`Помидоры
Морковка
Лук репчатый
Перец болгарский
Чеснок
Сахар
Соль
Уксус 9%
Масло растительное`,
`Лук и болгарский перец нарежьте полукольцами
Помидоры нарежьте дольками, а морковку натрите на терке
Влейте в кастрюлю масло, добавьте овощи, чеснок и специи. Тушите на среднем огне 15-20 минут
Овощи сварились, влейте уксус, перемешайте и снимите с огня. Салат готов`
],
    
[
'Маринованные куриные ломтики', 
`Лайм
Чеснок
Соевый соус
Мед
Молотый перец чили
Зеленый лук
Куриная грудка
Растительное масло`,
`Приготовьте маринад из сока и цедры лайма, измельченного чеснока, соевого соуса, седа, чили и рубленого зеленого лука
Замаринуйте ломтики курицы на 15 минут, а затем быстро обжарьте на разогретой сковороде.`
],

]

export function getRandomRecipe(): string[] {
    const random = Math.floor(Math.random() * recipes.length);
    return recipes[random];
}
